# MySQL 연결

In [14]:
!pip install pymysql

Requirement already satisfied: pymysql in /Users/imhyeonjin/opt/anaconda3/lib/python3.8/site-packages (1.0.2)

In [1]:
import pymysql

In [2]:
#MySQL Connection

conn = pymysql.connect(host="localhost",user="root",passwd="qwer1234",db="education",charset="utf8")

In [3]:
curs = conn.cursor()

In [4]:
sql = "select*from student"
curs.execute(sql)

10

In [5]:
#Data Fetch
rows = curs.fetchall()
print(rows)

(('1234', '12345', '123', '124', None), ('5115', '4561334', '4561', '5115', None), ('dsgd', 'dadfda', 'adgag', 'adgas', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('sfdg', 'sfgs', 'sfgs', 'sfdsg', None))

In [6]:
#List로 변환

rowList = list(rows)
print(rowList)

[('1234', '12345', '123', '124', None), ('5115', '4561334', '4561', '5115', None), ('dsgd', 'dadfda', 'adgag', 'adgas', None), ('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('sfdg', 'sfgs', 'sfgs', 'sfdsg', None)]

In [7]:
print(rowList[0])

('1234', '12345', '123', '124', None)

In [8]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/imhyeonjin/opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /Users/imhyeonjin/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)

In [9]:
import pandas as pd
from sqlalchemy import create_engine

In [10]:
engine = create_engine("mysql+pymysql://root:qwer1234@localhost:3306/education?",convert_unicode=True)
conn = engine.connect()

In [11]:
data = pd.read_sql_table('student',conn)

# dataFrame을 Database로 Insert하기

In [12]:
#MySQL Connection

conn = pymysql.connect(host="localhost",user="root",passwd="qwer1234",db="daum",charset="utf8")

In [13]:
curs = conn.cursor()

In [14]:
column = ['rank',"title"]
movies = pd.read_csv("./Data/DaumList.csv")
movies.columns = column
movies.head()

   rank        title
0     1       블랙 위도우
1     2         발신제한
2     3         크루엘라
3     4  콰이어트 플레이스 2
4     5           랑종

In [15]:
engine = create_engine("mysql+pymysql://root:qwer1234@localhost:3306/daum?",convert_unicode=True)
conn = engine.connect()

In [16]:
movies.to_sql(name='daumlist',con=engine,if_exists='append',index=False)

In [35]:
#16. RottenTomato 영화 리스트 인서트하기

In [17]:
column = ['Index','Ratings',"Titles",'Reviews']
movies = pd.read_csv("./Data/RottenTomatoes.csv")
movies.columns = column
movies.head()

   Index Ratings                          Titles  Reviews
0      1     98%  Parasite (Gisaengchung) (2019)      459
1      2     94%        Avengers: Endgame (2019)      542
2      3     97%               Knives Out (2019)      464
3      4     93%                       Us (2019)      551
4      5     97%              Toy Story 4 (2019)      451

In [20]:
engine = create_engine("mysql+pymysql://root:qwer1234@localhost:3306/rottentomato?",convert_unicode=True)
conn = engine.connect()

In [21]:
movies.to_sql(name='rotten_list',con=engine,if_exists='append',index=False)